-- Сформировать запрос для получения числа в СПбГУ ИТМО хорошистов.

select Н_ЛЮДИ.ИД, avg(cast(ОЦЕНКА as INTEGER))
from Н_УЧЕНИКИ
         inner join Н_ЛЮДИ on ЧЛВК_ИД = Н_ЛЮДИ.ИД
         inner join Н_ВЕДОМОСТИ on Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
where Н_ВЕДОМОСТИ.СОСТОЯНИЕ = 'актуальна'
  and ОЦЕНКА != 'зачет'
  and ОЦЕНКА != 'осв'
group by Н_ЛЮДИ.ИД, ОЦЕНКА
having ОЦЕНКА != '3'
   and ОЦЕНКА != '2'
   and ОЦЕНКА != 'незач'
   and ОЦЕНКА != 'неявка'
   and ОЦЕНКА != '99'
   and avg(cast(ОЦЕНКА as INTEGER)) != 5




select count(res.avg)
from (select Н_ЛЮДИ.ИД, avg(cast(ОЦЕНКА as INTEGER))
      from Н_УЧЕНИКИ
               inner join Н_ЛЮДИ on ЧЛВК_ИД = Н_ЛЮДИ.ИД
               inner join Н_ВЕДОМОСТИ on Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
      where Н_ВЕДОМОСТИ.СОСТОЯНИЕ = 'актуальна'
        and ОЦЕНКА != 'зачет'
        and ОЦЕНКА != 'осв'
      group by Н_ЛЮДИ.ИД, ОЦЕНКА
      having ОЦЕНКА != '3'
         and ОЦЕНКА != '2'
         and ОЦЕНКА != 'незач'
         and ОЦЕНКА != 'неявка'
         and ОЦЕНКА != '99'
         and avg(cast(ОЦЕНКА as INTEGER)) != 5) as res;


-- Результат 3026
